app/controllers/api/dropdowns_controller.rb

SELECT DISTINCT [dbo].[TC60_Divisions].[Division], [dbo].[TC60_Divisions].[LongName] FROM [dbo].[TC60_Divisions] WHERE [dbo].[TC60_Divisions].[Agency] = N'GSA'
---
    def divisions
      divisions = Coa::Division.where(Agency: params[:agency])
                               .select(:Division, :LongName)
                               .distinct
                               .map { |d| { value: d.Division, label: d.LongName.to_s } }

SELECT DISTINCT [dbo].[TC60_Departments].[Department], [dbo].[TC60_Departments].[LongName] FROM [dbo].[TC60_Departments] WHERE [dbo].[TC60_Departments].[Agency] = N'GSA' AND [dbo].[TC60_Departments].[Division] = N'4600'
---
    def departments
      departments = Coa::Department.where(Agency: params[:agency], Division: params[:division])
                                   .select(:Department, :LongName)
                                   .distinct
                                   .map { |d| { value: d.Department, label: d.LongName.to_s } }

SELECT DISTINCT [dbo].[TC60_Units].[Unit], [dbo].[TC60_Units].[LongName] FROM [dbo].[TC60_Units] WHERE [dbo].[TC60_Units].[Agency] = N'GSA' AND [dbo].[TC60_Units].[Division] = N'4600' AND [dbo].[TC60_Units].[Department] = N'4601'
---
    def units
      units = Coa::Unit.where(Agency: params[:agency], Division: params[:division], Department: params[:department])
                       .select(:Unit, :LongName)
                       .distinct
                       .map { |u| { value: u.Unit, label: "#{u.Unit} #{u.LongName}" } }