app/views/parking_lot_submissions/new.html.erb

SELECT [dbo].[TC60_Agencies].* FROM [dbo].[TC60_Agencies]
---
    <%= form.label :agency, "Agency" %>
    <%= form.select :agency,
          options_for_select(@agency_options, @prefill_data[:agency]),
          {},
          class: "form-control",
          id: "agency-select",
          data: {

SELECT [dbo].[TC60_Units].* FROM [dbo].[TC60_Units]
---
    <%= form.label :unit, "Unit" %>
    <%= form.select :unit,
          options_for_select(@unit_options, @prefill_data[:unit]),
          {},
          class: "form-control",
          id: "unit-select",
          data: { gsabss_selects_target: "unit" } %>