app/controllers/parking_lot_submissions_controller.rb

def new
  @parking_lot_submission = ParkingLotSubmission.new
  @parking_lot_submission.parking_lot_vehicles.build

  # Safely read session
  employee_id = session.dig(:user, "employee_id").to_s
  @employee   = employee_id.present? ? Employee.find_by(employee_id: employee_id) : nil

  unless @employee
    redirect_to login_path, alert: "Please sign in to start a submission." and return

    @agency_options     = Agency.order(:long_name).pluck(:long_name, :agency_id)
    @division_options   = []
    @department_options = []
    @unit_options       = []
    return
  end

  # MB3 flag. The live Employees table has no union_code column, so read it
  # defensively — everyone is treated as non-MB3 until a real source exists.
  @is_mb3 = employee_union_code(@employee) == "MB3"

  # Org lookups (guard each step)
  unit        = Unit.resolve_for_employee(@employee)
  department  = unit ? Department.find_by(department_id: unit.department_id) : nil
  division    = department ? Division.find_by(division_id: department.division_id) : nil
  agency      = division ? Agency.find_by(agency_id: division.agency_id) : nil

  # Prefill with IDs (unit = ID only)
  @prefill_data = {
    employee_id: @employee.employee_id,
    name:        [@employee.first_name, @employee.last_name].compact.join(" "),
    phone:       @employee.work_phone,
    email:       @employee.email,
    agency:      agency&.agency_id,
    division:    division&.division_id,
    department:  department&.department_id,
    unit:        unit&.unit_id
---
SELECT [dbo].[TC60_Units].* FROM [dbo].[TC60_Units]

  def set_parking_lot_submission
    @parking_lot_submission = ParkingLotSubmission.find(params[:id])
---
SELECT [parking_lot_submissions].* FROM [parking_lot_submissions] WHERE [parking_lot_submissions].[id] = 17 ORDER BY [parking_lot_submissions].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY