app/controllers/parking_lot_submissions_controller.rb

  def new
    @parking_lot_submission = ParkingLotSubmission.new

    # GSABSS lookups
    @agency_options = Agency.all.map { |a| ["#{a.Agency} #{a.LongName}", a.Agency] }

    @form_logo = "/assets/images/default-logo.svg"

    @form_pages = [
      {
        title: "Employee Info",
        fields: [
          { name: "name", label: "Name", type: "text", required: true },
          { name: "phone", label: "Phone", type: "text", required: true },
          { name: "employee_id", label: "Employee ID", type: "text", required: true },
          { name: "email", label: "Email", type: "text", required: true }
        ]
      },
      {
        title: "Agency Info",
        fields: [
          { name: "agency", label: "Agency", type: "select", required: true, options: Agency.all.pluck(:LongName) },
          { name: "division", label: "Division", type: "select", required: true, options: Division.all.pluck(:LongName) },
          { name: "department", label: "Department", type: "select", required: true, options: Department.all.pluck(:LongName) },
          { name: "unit", label: "Unit", type: "select", required: true, options: Unit.all.map { |u| ["#{u.Unit} #{u.LongName}", u.Unit] } }
        ]
      },
      {
        title: "Vehicle Info",
        fields: [
          { name: "make", label: "Make", type: "text", required: true },
          { name: "model", label: "Model", type: "text", required: true },
          { name: "color", label: "Color", type: "select", options: %w[White Black Silver Blue Red Green Yellow Gray Brown Other] },
          { name: "year", label: "Year", type: "select", options: (1920..Date.today.year).to_a.reverse },
          { name: "license_plate", label: "License Plate", type: "text", required: true }
        ]
      },
      {
        title: "Parking Details",
        fields: [
          { name: "parking_lot", label: "Parking Lot", type: "text", required: true },
          { name: "old_permit_number", label: "Old Permit Number", type: "text", required: false }
        ]
      }
    ]
---
SELECT [dbo].[TC60_Agencies].* FROM [dbo].[TC60_Agencies]
SELECT [dbo].[TC60_Departments].[LongName] FROM [dbo].[TC60_Departments]
SELECT [dbo].[TC60_Divisions].[LongName] FROM [dbo].[TC60_Divisions]
SELECT [dbo].[TC60_Units].[Unit], [dbo].[TC60_Units].[LongName] FROM [dbo].[TC60_Units]
SELECT [dbo].[TC60_Agencies].[LongName] FROM [dbo].[TC60_Agencies]
SELECT [dbo].[TC60_Units].* FROM [dbo].[TC60_Units]

  def create
    @parking_lot_submission = ParkingLotSubmission.new(parking_lot_submission_params)
    @parking_lot_submission.status = 0

    if @parking_lot_submission.save
---
INSERT INTO [parking_lot_submissions] ([name], [phone], [employee_id], [email], [agency], [division], [department], [make], [model], [color], [year], [license_plate], [parking_lot], [old_permit_number], [created_at], [updated_at], [unit], [status]) OUTPUT INSERTED.[id] VALUES (N'TestQueue5', N'fdsf', N'sdfsdf', N'sdf', N'BEL', N'5670', N'5670', N'fdsf', N'sdfdsf', N'sdfs', N'sdf', N'sdfs', N'sfdf', N'sdf', '07-08-2025 02:50:46.167349', '07-08-2025 02:50:46.167349', N'5670', NULL)

   def approve
  @submission = ParkingLotSubmission.find(params[:id])
  @submission.update!(status: :manager_approved)
---
SELECT [parking_lot_submissions].* FROM [parking_lot_submissions] WHERE [parking_lot_submissions].[id] = 7 ORDER BY [parking_lot_submissions].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
UPDATE [parking_lot_submissions] SET [updated_at] = '07-08-2025 03:23:09.57863', [status] = NULL WHERE [parking_lot_submissions].[id] = 7; SELECT @@ROWCOUNT AS AffectedRows

def index
  @pending_submissions = ParkingLotSubmission.where(status: 0)
---
SELECT [parking_lot_submissions].* FROM [parking_lot_submissions] WHERE [parking_lot_submissions].[status] = 0