app/jobs/notify_security_job.rb

SELECT [parking_lot_submissions].* FROM [parking_lot_submissions] WHERE [parking_lot_submissions].[id] = 7 ORDER BY [parking_lot_submissions].[id] ASC OFFSET 0 ROWS FETCH NEXT 1 ROWS ONLY
---
  def perform(submission_id)
    submission = ParkingLotSubmission.find(submission_id)